app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM "projects"