app/controllers/projects_controller.rb

  def index
    user = User.find(session[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def adduser
    @project = Project.find(params[:id])
    return if !auth_check(@project)

    @email = params[:email]
    user = User.find(:first, :conditions => "email = '#{@email}'")
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "users" WHERE (email = 'asdas') LIMIT 1

  def create
    @project = Project.new(params[:project])
    user = User.find(session[:id])
    user.projects.push(@project)
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "projects" ("created_at", "title", "updated_at") VALUES('2010-03-13 16:38:52', 'Pong', '2010-03-13 16:38:52')

  def update
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 980190962)

  def destroy
    @project = Project.find(params[:id])
    return if !auth_check(@project)

    @project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 980190962)
DELETE FROM "projects" WHERE "id" = 980190962