app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT * FROM "stories"

  def show
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 980190962)

  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("created_at", "project_id", "updated_at", "description", "column_id") VALUES('2010-03-14 20:56:51', 2, '2010-03-14 20:56:51', 'Add a menu bar

  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)
UPDATE "stories" SET "updated_at" = '2010-03-14 19:48:15', "column_id" = 10 WHERE "id" = 1

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT * FROM "stories" WHERE ("stories"."id" = 980190962)
DELETE FROM "stories" WHERE "id" = 980190962