app/controllers/user_controller.rb

  def create
    if (params['user']['password'] != params['user']['password_confirmed']) then
      flash[:notice] = 'Your passwords dont match'
      render :action => "signup"
      return
    end

    if User.find(:first, :conditions => { :email => params['user']['email'], :password => params['user']['password'] }) then
      flash[:notice] = 'User already exists.'
      render :action => "signup"
      return
    end

    user = User.new do |signup|
      signup.email = params['user']['email']
      signup.password = params['user']['password']
    end
    user.save
---
SELECT * FROM "users" WHERE ("users"."password" = 'nkostelnik@gmail.com' AND "users"."email" = 'nkostelnik@gmail.com') LIMIT 1
INSERT INTO "users" ("created_at", "updated_at", "password", "email") VALUES('2010-03-14 22:19:29', '2010-03-14 22:19:29', 'nkostelnik@gmail.com', 'nkostelnik@gmail.com')

  def authenticate
    user = User.find(:first, :conditions => { :email => params['login']['email'], :password => params['login']['password'] })
---
SELECT * FROM "users" WHERE ("users"."password" = 'k0steln1k' AND "users"."email" = 'nkostelnik@gmail.com') LIMIT 1