old/app/controllers/columns_controller.rb

SELECT * FROM "columns"
---
  def index
    @columns = Column.all

SELECT * FROM "columns" WHERE ("columns"."id" = 1)
---
  def show
    @column = Column.find(params[:id])

INSERT INTO "columns" ("created_at", "title", "project_id", "updated_at") VALUES('2010-03-13 19:13:33', 'dsadas', 1, '2010-03-13 19:13:33')
---
  def create
    @column = Column.new(params[:column])

    respond_to do |format|
      if @column.save