old/app/controllers/user_controller.rb

SELECT * FROM "users" WHERE ("users"."password" = 'nkostelnik@gmail.com' AND "users"."email" = 'nkostelnik@gmail.com') LIMIT 1
INSERT INTO "users" ("created_at", "updated_at", "password", "email") VALUES('2010-03-14 22:19:29', '2010-03-14 22:19:29', 'nkostelnik@gmail.com', 'nkostelnik@gmail.com')
---
  def create
    if (params['registration']['password'] != params['registration']['password_confirmed']) then
      flash[:notice] = 'Your passwords dont match'
      render :action => "signup"
      return
    end

    if User.find(:first, :conditions => { :email => params['registration']['email'], :password => params['registration']['password'] }) then
      flash[:notice] = 'User already exists.'
      render :action => "signup"
      return
    end

    user = User.new do |signup|
      signup.email = params['registration']['email']
      signup.password = params['registration']['password']
    end
    user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def findall
    users = User.find(:all)

SELECT * FROM "users" WHERE ("users"."password" = 'k0steln1k' AND "users"."email" = 'nkostelnik@gmail.com') LIMIT 1
---
  def authenticate
    user = User.find(:first, :conditions => { :email => params['login']['email'], :password => params['login']['password'] })